      /FREE
      //%METADATA                                                      *
      // %TEXT copybook for h-spec                                     *
      //%EMETADATA                                                     *
         ctl-opt option(*nodebugio:*srcstmt:*nounref);
         ctl-opt copyright('Programmers.io © 2020 ');
      /END-FREE
